# Reading Data from SQL Database

### Pandas can read from HTML, JSON, SQL, Excel (!!!), HDF5, Stata, etc.

We will study about reading data from SQLite databases.

In [34]:
import pandas as pd
import sqlite3

The `read_sql` function will automatically convert SQL column names to DataFrame column names. It takes 2 arguments: a `SELECT` statement, and a database connection object. This is great because it means you can read from any kind of SQL database.

The following SQLite database is extracted from https://www.dropbox.com/s/a2wax843eniq12g/flights.db?dl=0

In [35]:
con = sqlite3.connect("flights.db")
df = pd.read_sql("SELECT * from airlines LIMIT 5", con)
df

,index,id,name,alias,iata,icao,callsign,country,active
0,0,1,Private flight,\N,-,None,None,None,Y
1,1,2,135 Airways,\N,None,GNL,GENERAL,United States,N
2,2,3,1Time Airline,\N,1T,RNX,NEXTIME,South Africa,Y
3,3,4,2 Sqn No 1 Elementary Flying Training School,\N,None,WYT,None,United Kingdom,N
4,4,5,213 Flight Unit,\N,None,TFU,None,Russia,N

`read_sql` doesn't automatically set the primary key (id) to be the index of the dataframe. You can make it do that by adding an index_col argument to read_sql.

In [33]:
df = pd.read_sql("SELECT * from airlines LIMIT 3", con, index_col='id')
df

    index            name alias  iata  icao callsign        country active
id
1       0  Private flight    \N     -  None     None           None      Y
2       1     135 Airways    \N  None   GNL  GENERAL  United States      N
3       2   1Time Airline    \N    1T   RNX  NEXTIME   South Africa      Y

To index the data frame by more than one column, you can give a list of columns to index_col:

In [38]:
df = pd.read_sql("SELECT * from airlines LIMIT 3", con, 
                 index_col=['id', 'name', 'index'])
df

                        alias  iata  icao callsign        country active
id name           index
1  Private flight 0        \N     -  None     None           None      Y
2  135 Airways    1        \N  None   GNL  GENERAL  United States      N
3  1Time Airline  2        \N    1T   RNX  NEXTIME   South Africa      Y